app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("created_at", "due_at", "location", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2014-10-23 18:03:24.421254"], ["due_at", "2014-10-31"], ["location", "At home and GA"], ["title", "Make my new app!"], ["updated_at", "2014-10-23 18:03:24.421254"], ["user_id", 3]]
---
def create
  @task = Task.new(task_params)
  if @task.save

SELECT  "tasks".* FROM "tasks"   ORDER BY "tasks"."id" ASC LIMIT 1
---
def index
  @tasks = Task.all

SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "tasks" SET "title" = $1, "updated_at" = $2 WHERE "tasks"."id" = 806  [["title", "Walk the dog"], ["updated_at", "2014-10-15 16:45:24.488272"]]
---
def update
  @task = Task.find(params[:id])
  if @task.update_attributes(task_params)